export const faqList = [
    {
       id: 1,
       questionName:
          "Оказывается, логотип крупнейшей компании по производству...",
       questionDescription:
          "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
    },
    {
      id: 2,
       questionName: "Давайте разбираться: герцог графства коронован",
       questionDescription:
          "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
    },
    {
      id: 3,
       questionName: "Воистину радостный звук: глас грядущего поколения",
       questionDescription:
          "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
    },
    {
      id: 4,
       questionName:
          "Дурное дело нехитрое: глубокий уровень погружения...",
       questionDescription:
          "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
    },
    {
      id: 5,
       questionName:
          "Тяжёлое машиностроение — это вам не грохот грома грядущи...",
       questionDescription:
          "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
    },
    {
      id: 6,
       questionName:
          "Давайте не забывать, что сплочённость команды...",
       questionDescription:
          "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
    },
    {
      id: 7,
       questionName:
          "Независимые СМИ потому и независимы, что в провинциях ещ...",
       questionDescription:
          "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
    },
    {
      id: 8,
       questionName: "Солнечных дней всё меньше",
       questionDescription:
          "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
    },
    {
      id: 9,
       questionName: "Базовый вектор развития продолжает удивлять",
       questionDescription:
          "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
    },
    {
      id: 10,
       questionName:
          "Как бы то ни было, добрая половина выводов ни к чему нас не...",
       questionDescription:
          "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
    },
 ];

