export const faqList = [
   {
      id: 1,
      questionName:
         "Оказывается, логотип крупнейшей компании по производству мыльных пузырей попахивает безумием",
      questionDescription:
         "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
   },
   {
     id: 2,
      questionName: "Давайте разбираться: герцог графства коронован",
      questionDescription:
         "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
   },
   {
     id: 3,
      questionName: "Воистину радостный звук: глас грядущего поколения",
      questionDescription:
         "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
   },
   {
     id: 4,
      questionName:
         "Дурное дело нехитрое: глубокий уровень погружения продолжает удивлять.",
      questionDescription:
         "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
   },
   {
     id: 5,
      questionName:
         "Тяжёлое машиностроение — это вам не грохот грома грядущих изменений",
      questionDescription:
         "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
   },
   {
     id: 6,
      questionName:
         "Давайте не забывать, что сплочённость команды профессионалов расставила все точки над i",
      questionDescription:
         "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
   },
   {
     id: 7,
      questionName:
         "Независимые СМИ потому и независимы, что в провинциях ещё есть чем поживиться",
      questionDescription:
         "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
   },
   {
     id: 8,
      questionName: "Солнечных дней всё меньше",
      questionDescription:
         "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
   },
   {
     id: 9,
      questionName: "Базовый вектор развития продолжает удивлять",
      questionDescription:
         "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
   },
   {
     id: 10,
      questionName:
         "Как бы то ни было, добрая половина выводов ни к чему нас не обязывает",
      questionDescription:
         "Идейные соображения высшего порядка, а также новая модель организационной деятельности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач.",
   },
];

