import s from './textContent.module.sass'

const TextContent = () => {
    return (
        <div className={s.textContent}>
            <h2>Архив президента создана для:</h2>

            <p>Архив президента создается с целью сохранения и организации документов, записей и других материалов,
                связанных с президентской деятельностью.</p>
            <p>Архив президента создается с целью сохранения и организации документов, записей и других материалов,
                связанных с президентской деятельностью.
            </p>

        </div>
    );
};

export default TextContent;