import css from "./Codex.module.sass";

const btnMenu = [
   {
      title: "Закон о содействии занятости населения",
   },
   {
      title: "Положение о порядке, условиях и сроках выплаты пособий по безработице",
   },
   {
      title: "Положение о профессиональной подготовке, переподготовке и повышении квалификации безработных граждан",
   },
   {
      title: "Порядок регистрации граждан в качестве безработных или ищущих работу",
   },
   {
      title: "Положение об организации оплачиваемых общественных работ",
   },
   {
      title: "Порядок регистрации граждан в качестве безработных или ищущих работу",
   },
   {
      title: "Положение об организации оплачиваемых общественных работ",
   },
   {
      title: "Постановление  О мерах по реализации Закона Кыргызской Республики “О содействии занятости населения”",
   },
   {
      title: "Постановление  О мерах по реализации Закона Кыргызской Республики “О содействии занятости населения”",
   },
];

export const Codex = () => {
   return (
      <div className="container">
         <div className={css.codex}>
            <h2>Кодексы</h2>
            <div className={css.btnCodex}>
               {btnMenu.map((name, index) => {
                  return <button key={index}>{name.title}</button>;
               })}
            </div>
         </div>
      </div>
   );
};
